In [145]:
import pandas as pd

In [146]:
data = [[2, 'Crew'], [4, 'Haven'], [5, 'Kristian']]
employees = pd.DataFrame(data, columns=['employee_id', 'name']).astype({'employee_id':'Int64', 'name':'object'})
data = [[5, 76071], [1, 22517], [4, 63539]]
salaries = pd.DataFrame(data, columns=['employee_id', 'salary']).astype({'employee_id':'Int64', 'salary':'Int64'})

In [147]:
df = pd.merge(employees,salaries,on='employee_id',how='outer')
df

   employee_id      name  salary
0            1       NaN   22517
1            2      Crew    <NA>
2            4     Haven   63539
3            5  Kristian   76071

In [148]:
result = df[df.isna().any(axis=1)]['employee_id'].reset_index().drop(columns='index')

In [149]:
result

   employee_id
0            1
1            2